Revit 2027 API
OverrideGraphicSettings.SurfaceBackgroundPatternColor Property
 The override color of the surface background pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SurfaceBackgroundPatternColor { get; }
Public ReadOnly Property SurfaceBackgroundPatternColor As Color
	Get
public:
property Color^ SurfaceBackgroundPatternColor {
	Color^ get ();
}
member SurfaceBackgroundPatternColor : Color with get
Property Value
Color
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace